---
kind: property
id: P:Autodesk.Revit.DB.View.PartsVisibility
zh: 视图
source: html/d4caa303-3aba-8339-08a4-84d08f20db84.htm
---
# Autodesk.Revit.DB.View.PartsVisibility Property

**中文**: 视图

The visibility setting for parts in this view.

## Syntax (C#)
```csharp
public PartsVisibility PartsVisibility { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration